tutorials/waveFoamGABC/hydroPower/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-70 -10 -0.1)
    ( -3 -10 -0.1)
    ( -0 -10 -0.1)
    (-70   0 -0.1)
    ( -3   0 -0.1)
    ( -0   0 -0.1)
    (  5 -16 -0.1)
    (  5 -15 -0.1)

    (-70 -10  0.1)
    ( -3 -10  0.1)
    ( -0 -10  0.1)
    (-70   0  0.1)
    ( -3   0  0.1)
    ( -0   0  0.1)
    (  5 -16  0.1)
    (  5 -15  0.1)

    ( 100 -16  -0.1)
    ( 100 -15  -0.1)
    ( 100 -16   0.1)
    ( 100 -15   0.1)

    (  5 -25  -0.1)
    ( 100 -25  -0.1)
    (  5  -5  -0.1)
    ( 100  -5  -0.1)

    (  5 -25   0.1)
    ( 100 -25   0.1)
    (  5  -5   0.1)
    ( 100  -5   0.1)
);

blocks          
(
    hex (0 1 4 3 8 9 12 11) ( 100 70 1 ) simpleGrading (0.20 1 1)
    hex (1 2 5 4 9 10 13 12) ( 15 70 1 ) simpleGrading (1 1 1)
    hex (1 6 7 2 9 14 15 10) ( 70 15 1 ) simpleGrading (1 1 1)
    hex (6 16 17 7 14 18 19 15) ( 140 15 1 ) simpleGrading (1 1 1)

    hex (20 21 16 6 24 25 18 14) ( 140 30 1 ) simpleGrading (1 0.65 1)
    hex (7 17 23 22 15 19 27 26) ( 140 40 1 ) simpleGrading (1 1.33 1)
);

edges           
(
//    arc 1 6 (0.7574 -14.2426 -0.1)
    arc 1 6 (-0.6569 -13.6569 -0.1)
    arc 2 7 (1.4645 -13.5355 -0.1)
//    arc 9 14 (0.7574 -14.2426 0.1)
    arc 9 14 (-0.6569 -13.6569 0.1)
    arc 10 15 (1.4645 -13.5355 0.1)
);

patches         
(
    patch inlet
    (
        (0 8 11 3)
    )
    patch bottom 
    (
        (0 1 9 8)
        (2 10 13 5)
        (1 6 14 9)
        (2 7 15 10)
        (7 15 26 22)
        (20 24 14 6)
        (20 21 25 24)
    )
    patch outlet
    (
        (21 25 18 16)
        (16 18 19 17)
        (17 19 27 23)
    )

    patch atmosphere 
    (
        (3 4 12 11)
        (4 5 13 12)
        (22 23 27 26)
    )
    
    empty back
    (
        (0 1 4 3)
        (1 2 5 4)
        (1 6 7 2)
        (6 16 17 7)
        (20 21 16 6)
        (7 17 23 22)
    )

    empty front
    (
        (8 9 12 11)
        (9 10 13 12)
        (9 14 15 10)
        (14 18 19 15)
        (24 25 18 14)
        (15 19 27 26)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
